<center>
    <h1 style="color:blue"> YSU MMF, Python, Spring 2021 </h1>
    <h2 style="color:blue"> Lecture 21 </h2>
</center>

In [1]:
import numpy as np
import matplotlib.pyplot as plt

In [2]:
import pandas as pd

## Pandas Series

- Change one of the values in the Series

In [3]:
l = [4,4,5,6]

In [16]:
s1 = pd.Series(l,index=list('abcd'))

In [17]:
s1[['a','c']] = 20,30

In [18]:
s1

a    20
b     4
c    30
d     6
dtype: int64

- Create a Series of random numbers, choose all positives and their indices

In [41]:
s2 = pd.Series(np.random.randn(10))

In [42]:
s2

0    1.562936
1    0.306577
2    1.012357
3    1.324782
4    0.351332
5   -0.799875
6   -0.184685
7   -1.213743
8    0.832762
9    0.756425
dtype: float64

In [43]:
s2 > 0

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
8     True
9     True
dtype: bool

In [44]:
s2[s2 > 0]

0    1.562936
1    0.306577
2    1.012357
3    1.324782
4    0.351332
8    0.832762
9    0.756425
dtype: float64

In [46]:
s2a=s2[s2>0]

In [47]:
list(s2a.index)

[0, 1, 2, 3, 4, 8, 9]

- Multiply all elements in the Series by 3

In [48]:
3*s2a

0    4.688809
1    0.919732
2    3.037072
3    3.974346
4    1.053995
8    2.498285
9    2.269276
dtype: float64

- Calculate the Exponential of all elements in the Series

In [49]:
np.exp(s2)

0    4.772815
1    1.358767
2    2.752081
3    3.761366
4    1.420959
5    0.449385
6    0.831366
7    0.297083
8    2.299661
9    2.130646
dtype: float64

- Add two Series with the same/not all the same indices

In [50]:
s3 = pd.Series(np.arange(5), index = list('abcde'))
s4 = pd.Series([10,20,30,40,50],index = list('abcde'))

In [54]:
s3

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [55]:
s4

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [56]:
s3+s4

a    10
b    21
c    32
d    43
e    54
dtype: int64

In [60]:
s5 = pd.Series(100*np.arange(1,6),index = ['a','e','d','f','g'])

In [61]:
s5 + s3

a    100.0
b      NaN
c      NaN
d    303.0
e    204.0
f      NaN
g      NaN
dtype: float64

- Give a name for Series and its indices

In [62]:
s5.name = 'gnahatakan'

In [64]:
s5.index.name = 'No.'

In [65]:
s5

No.
a    100
e    200
d    300
f    400
g    500
Name: gnahatakan, dtype: int32

## Pandas DataFrame

- Create a DataFrame from a list, then change the column name

In [66]:
l = [1,2,3,4]

In [71]:
df1 = pd.DataFrame(l,index = ['AA','Aa','Ac','AD'], columns=['age'])

In [72]:
df1

    age
AA    1
Aa    2
Ac    3
AD    4

- Create a DataFrame from the List of Lists

In [92]:
l1 = [[1,2,3,4],[None,6,7,8],[9,10,11,12]]

In [95]:
df2 = pd.DataFrame(l1,columns=['A','B','C','D'],index = ['AA','BB','CC'])

In [96]:
df2

      A   B   C   D
AA  1.0   2   3   4
BB  NaN   6   7   8
CC  9.0  10  11  12

- Create a Dataframe from a Dictionary

In [104]:
d1 = {'A':[1,2,3],'B':[4,None,6],'C':[4,6,8]}

In [105]:
df3 = pd.DataFrame(d1)

In [106]:
df3

   A    B  C
0  1  4.0  4
1  2  NaN  6
2  3  6.0  8

In [107]:
df3a = df3 = pd.DataFrame(d1,columns=['B','A','C'])

In [108]:
df3a

     B  A  C
0  4.0  1  4
1  NaN  2  6
2  6.0  3  8

In [109]:
df3ab = df3 = pd.DataFrame(d1,columns=['B','A','C','Q'])
df3ab

     B  A  C    Q
0  4.0  1  4  NaN
1  NaN  2  6  NaN
2  6.0  3  8  NaN

- Create a Dataframe from a List of Dictionaries

In [157]:
l3 = [{'a':1,'b':2,'d':6},{'a':5,'b':6,'c':5}]

In [158]:
df5 = pd.DataFrame(l3)

In [159]:
df5

   a  b    d    c
0  1  2  6.0  NaN
1  5  6  NaN  5.0

- Get the Column names of a DataFrame, change it

In [160]:
df5.columns

Index(['a', 'b', 'd', 'c'], dtype='object')

In [161]:
df5.columns = ['AA','BB','CC','DD']

In [162]:
df5

   AA  BB   CC   DD
0   1   2  6.0  NaN
1   5   6  NaN  5.0

In [163]:
df5.index = ['a','b']

In [164]:
df5

   AA  BB   CC   DD
a   1   2  6.0  NaN
b   5   6  NaN  5.0

- Print the head and tail of a DataFrame

In [165]:
df5.head(100)

   AA  BB   CC   DD
a   1   2  6.0  NaN
b   5   6  NaN  5.0

In [166]:
df6 = df5.T

In [167]:
df6.tail()

      a    b
AA  1.0  5.0
BB  2.0  6.0
CC  6.0  NaN
DD  NaN  5.0

- Select a Column in a DataFrame

In [168]:
df5

   AA  BB   CC   DD
a   1   2  6.0  NaN
b   5   6  NaN  5.0

In [172]:
df5['BB']

a    2
b    6
Name: BB, dtype: int64

In [173]:
df5['CC'] = 5,7

In [176]:
df5.DD = 6

In [177]:
df5

   AA  BB  CC  DD
a   1   2   5   6
b   5   6   7   6

- Add a column to a Dataframe

In [178]:
df5['EE'] = 10,20

In [182]:
df5

   AA  BB  CC  DD  EE
a   1   2   5   6  10
b   5   6  20   6  20

In [181]:
df5['CC']['b'] = 20

<ipython-input-181-095324344cd3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5['CC']['b'] = 20

- Select a Row in a DataFrame

In [184]:
df5.loc['a']

AA     1
BB     2
CC     5
DD     6
EE    10
Name: a, dtype: int64

In [185]:
df6 = df5.T

In [186]:
df6

     a   b
AA   1   5
BB   2   6
CC   5  20
DD   6   6
EE  10  20

In [187]:
df6.loc[['AA','CC']]

    a   b
AA  1   5
CC  5  20

In [190]:
df6.loc['AA':'CC']

    a   b
AA  1   5
BB  2   6
CC  5  20

In [191]:
df6.iloc[3]

a    6
b    6
Name: DD, dtype: int64

- Add a Row to a DataFrame

 - Sort a Series and DataFrame by indices; by columns, by values